In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')

In [3]:
df = pd.read_csv("input/train.csv")
test = pd.read_csv("input/test.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
total_Passengers = df.PassengerId.count()

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
ave_age = (df['Age'].sum())/(total_Passengers-df.Age.isnull().sum())
df['Age'].fillna(ave_age, inplace = True)

In [8]:
df.Age.isnull().sum()

0

In [29]:
X = pd.DataFrame()
X['Sex'] = df['Sex']
X['Age'] = df['Age']

In [30]:
X.head()

      Sex   Age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [31]:
X.loc[X.Sex == 'male','Sex']=1
X.loc[X.Sex == 'female','Sex']=0
X.head()

  Sex   Age
0   1  22.0
1   0  38.0
2   0  26.0
3   0  35.0
4   1  35.0

In [55]:
y = df['Survived']
y.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [61]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(penalty='l2', C=100000)

In [67]:
model.fit(X,y)

LogisticRegression(C=100000, class_weight=None, dual=False,
          fit_intercept=True, intercept_scaling=1, max_iter=100,
          multi_class='ovr', n_jobs=1, penalty='l2', random_state=None,
          solver='liblinear', tol=0.0001, verbose=0, warm_start=False)

In [76]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [77]:
total_Passengers_test = test.PassengerId.count()
ave_age_test = (test['Age'].sum())/(total_Passengers_test-test.Age.isnull().sum())
test['Age'].fillna(ave_age_test, inplace = True)

In [78]:
X_test = pd.DataFrame()
X_test['Sex'] = test['Sex']
X_test['Age'] = test['Age']

In [79]:
X_test.loc[X_test.Sex == 'male','Sex']=1
X_test.loc[X_test.Sex == 'female','Sex']=0

In [84]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [85]:
result = pd.DataFrame()
result['PassengerId'] = test['PassengerId']

In [86]:
result['Survived'] = model.predict(X_test)

In [87]:
result.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [94]:
result.to_csv('result.csv',encoding='utf-8', index=False)